Configuration/ChartsOfCharacteristicTypes/бит_ум_ДополнительныеПараметрыПечати.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>бит_ум_ДополнительныеПараметрыПечати</Name>
			<Type>
				<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
				<v8:Type>cfg:EnumRef.бит_ум_ПричинаИзмененияСведений</v8:Type>
				<v8:Type>cfg:CatalogRef.Должности</v8:Type>
				<v8:Type>cfg:EnumRef.бит_ум_ПричинаВыдачиДубликата</v8:Type>
				<v8:Type>xs:boolean</v8:Type>
				<v8:Type>cfg:CatalogRef.бит_ум_ОснованияДляРаботыБезРазрешения</v8:Type>
				<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
				<v8:Type>cfg:CatalogRef.бит_ум_ЗначенияПараметровПечати</v8:Type>
				<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>15</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>999</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяПараметра</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеАдреса</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автозаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

Configuration/ChartsOfCharacteristicTypes/бит_ум_ДополнительныеПараметрыПечати/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)
	
	ИмяПараметра = "";
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если НЕ (ТипЗначения.СодержитТип(Тип("Строка")) И ТипЗначения.Типы().Количество() = 1) Тогда
		ПолеАдреса = Ложь;
	КонецЕсли;
	
	Автозаполнение = ТипЗначения.Типы().Количество() = 1 И ТипЗначения.СодержитТип(Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ (ТипЗначения.Типы().Количество() = 1 И ТипЗначения.СодержитТип(Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"))) Тогда
		ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(
			ПроверяемыеРеквизиты,
			ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве("Свойство"));
	КонецЕсли;
	            
	Если НЕ СтроковыеФункцииКлиентСерверРФ.ТолькоКириллицаВСтроке(ИмяПараметра, Истина, "0123456789") Тогда
		ТекстСообщения = НСтр("ru = 'Имя параметра может содержать только буквы и цифры.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ИмяПараметра", , Отказ);
	КонецЕсли;
	
	Если СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Лев(ИмяПараметра, 1)) Тогда
		ТекстСообщения = НСтр("ru = 'Имя параметра не может начинаться с цифры.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ИмяПараметра", , Отказ);
	КонецЕсли;
	
	Если НЕ Отказ Тогда
		
		Запрос = Новый Запрос;
		
		Запрос.УстановитьПараметр("ИмяПараметра", ИмяПараметра);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеПараметрыПечати.Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.бит_ум_ДополнительныеПараметрыПечати КАК ДополнительныеПараметрыПечати
		|ГДЕ
		|	ДополнительныеПараметрыПечати.Ссылка <> &Ссылка
		|	И ДополнительныеПараметрыПечати.ИмяПараметра = &ИмяПараметра";
		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			ТекстСообщения = НСтр("ru = 'Такое имя параметра уже используется.'");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ИмяПараметра", , Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ТипЗначения.Типы().Количество() > 1 Тогда
		ТекстСообщения = НСтр("ru = 'Нужно выбрать один тип значения.'");
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ТипЗначения", , Отказ);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
